# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'AdoptOpenJDK/openjdk'

# Binaries
brew 'ack'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'

brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'mackup'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'
brew 'fzf'
brew 'swiftlint'
brew 'swiftformat'
brew 'z'
brew 'topgrade'
brew 'htop'
brew 'task' # Todo list cli (task add...)
brew 'cheat' # Cheatsheet of any command
brew 'TomAnthony/brews/itermocil' # Create special configuration to iterm

# Development
brew 'git-lfs'
brew 'carthage'
brew 'cmake'
brew 'repo'
brew 'ccache'
brew 'openssl'
# JIRA
brew 'atlassian-cli'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'fastlane'
cask 'spotify'
cask 'java'
cask 'ngrok'
cask 'visual-studio-code'
cask 'sourcetree'
cask 'skype'
cask 'slack'
cask 'box-sync'
cask 'bettertouchtool'
cask 'iterm2'
cask 'tor-browser'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'db-browser-for-sqlite'
cask 'intellij-idea-ce'

# Android
cask 'adoptopenjdk8'
cask 'android-ndk'
cask 'android-studio'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-meslo-for-powerline'
