# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'

brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'mackup'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'
brew 'fzf'
brew 'swiftlint'
brew 'swiftformat'
brew 'z'
brew 'topgrade'
brew 'htop'

# Development
brew 'git-lfs'
brew 'carthage'
brew 'cmake'
brew 'repo'
brew 'ccache'
brew 'openssl' 

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'fastlane'
cask 'spotify'
cask 'java'
cask 'ngrok'
cask 'visual-studio-code'
cask 'sourcetree'
cask 'skype'
cask 'slack'
cask 'box-sync'
cask 'bettertouchtool'
cask 'iterm2'
cask 'tor-browser'
cask 'transmit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Sip', id: 507257563
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'Unsplash', id: 1284863847
mas 'WhatsApp', id: 1147396723 
